app/controllers/artists_controller.rb

SELECT "songs".id FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "artists".* FROM "artists"
---
  def index
    if params[:artist_id]
      @songs = Artist.find(params[:artist_id]).songs
    else
      @artists = Artist.all